{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"name": "input_4", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_4", "sparse": false, "dtype": "float32", "batch_input_shape": [null, null, null, 3]}}, {"name": "zero_padding2d_4", "inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"padding": [[3, 3], [3, 3]], "name": "zero_padding2d_4", "data_format": "channels_last", "trainable": false}}, {"name": "conv1", "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 64, "padding": "valid", "name": "conv1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [7, 7], "trainable": false, "data_format": "channels_last", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn_conv1", "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn_conv1", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_148", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_148", "trainable": false, "activation": "relu"}}, {"name": "max_pooling2d_4", "inbound_nodes": [[["activation_148", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_4", "trainable": false, "data_format": "channels_last", "strides": [2, 2], "pool_size": [3, 3]}}, {"name": "res2a_branch2a", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 64, "padding": "valid", "name": "res2a_branch2a", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn2a_branch2a", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2a", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_149", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_149", "trainable": false, "activation": "relu"}}, {"name": "res2a_branch2b", "inbound_nodes": [[["activation_149", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 64, "padding": "same", "name": "res2a_branch2b", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn2a_branch2b", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2b", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_150", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_150", "trainable": false, "activation": "relu"}}, {"name": "res2a_branch2c", "inbound_nodes": [[["activation_150", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 256, "padding": "valid", "name": "res2a_branch2c", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "res2a_branch1", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 256, "padding": "valid", "name": "res2a_branch1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn2a_branch2c", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2c", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "bn2a_branch1", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn2a_branch1", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "add_49", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_49", "trainable": false}}, {"name": "activation_151", "inbound_nodes": [[["add_49", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_151", "trainable": false, "activation": "relu"}}, {"name": "res2b_branch2a", "inbound_nodes": [[["activation_151", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 64, "padding": "valid", "name": "res2b_branch2a", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn2b_branch2a", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2a", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_152", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_152", "trainable": false, "activation": "relu"}}, {"name": "res2b_branch2b", "inbound_nodes": [[["activation_152", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 64, "padding": "same", "name": "res2b_branch2b", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn2b_branch2b", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2b", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_153", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_153", "trainable": false, "activation": "relu"}}, {"name": "res2b_branch2c", "inbound_nodes": [[["activation_153", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 256, "padding": "valid", "name": "res2b_branch2c", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn2b_branch2c", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2c", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "add_50", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_151", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_50", "trainable": false}}, {"name": "activation_154", "inbound_nodes": [[["add_50", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_154", "trainable": false, "activation": "relu"}}, {"name": "res2c_branch2a", "inbound_nodes": [[["activation_154", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 64, "padding": "valid", "name": "res2c_branch2a", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn2c_branch2a", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2a", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_155", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_155", "trainable": false, "activation": "relu"}}, {"name": "res2c_branch2b", "inbound_nodes": [[["activation_155", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 64, "padding": "same", "name": "res2c_branch2b", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn2c_branch2b", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2b", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_156", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_156", "trainable": false, "activation": "relu"}}, {"name": "res2c_branch2c", "inbound_nodes": [[["activation_156", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 256, "padding": "valid", "name": "res2c_branch2c", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn2c_branch2c", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2c", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "add_51", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_154", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_51", "trainable": false}}, {"name": "activation_157", "inbound_nodes": [[["add_51", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_157", "trainable": false, "activation": "relu"}}, {"name": "res3a_branch2a", "inbound_nodes": [[["activation_157", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 128, "padding": "valid", "name": "res3a_branch2a", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn3a_branch2a", "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2a", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_158", "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_158", "trainable": false, "activation": "relu"}}, {"name": "res3a_branch2b", "inbound_nodes": [[["activation_158", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 128, "padding": "same", "name": "res3a_branch2b", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn3a_branch2b", "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2b", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_159", "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_159", "trainable": false, "activation": "relu"}}, {"name": "res3a_branch2c", "inbound_nodes": [[["activation_159", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 512, "padding": "valid", "name": "res3a_branch2c", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "res3a_branch1", "inbound_nodes": [[["activation_157", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 512, "padding": "valid", "name": "res3a_branch1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn3a_branch2c", "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2c", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "bn3a_branch1", "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn3a_branch1", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "add_52", "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_52", "trainable": false}}, {"name": "activation_160", "inbound_nodes": [[["add_52", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_160", "trainable": false, "activation": "relu"}}, {"name": "res3b_branch2a", "inbound_nodes": [[["activation_160", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 128, "padding": "valid", "name": "res3b_branch2a", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn3b_branch2a", "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2a", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_161", "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_161", "trainable": false, "activation": "relu"}}, {"name": "res3b_branch2b", "inbound_nodes": [[["activation_161", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 128, "padding": "same", "name": "res3b_branch2b", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn3b_branch2b", "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2b", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_162", "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_162", "trainable": false, "activation": "relu"}}, {"name": "res3b_branch2c", "inbound_nodes": [[["activation_162", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 512, "padding": "valid", "name": "res3b_branch2c", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn3b_branch2c", "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2c", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "add_53", "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_160", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_53", "trainable": false}}, {"name": "activation_163", "inbound_nodes": [[["add_53", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_163", "trainable": false, "activation": "relu"}}, {"name": "res3c_branch2a", "inbound_nodes": [[["activation_163", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 128, "padding": "valid", "name": "res3c_branch2a", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn3c_branch2a", "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn3c_branch2a", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_164", "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_164", "trainable": false, "activation": "relu"}}, {"name": "res3c_branch2b", "inbound_nodes": [[["activation_164", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 128, "padding": "same", "name": "res3c_branch2b", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn3c_branch2b", "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn3c_branch2b", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_165", "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_165", "trainable": false, "activation": "relu"}}, {"name": "res3c_branch2c", "inbound_nodes": [[["activation_165", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 512, "padding": "valid", "name": "res3c_branch2c", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn3c_branch2c", "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn3c_branch2c", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "add_54", "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_163", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_54", "trainable": false}}, {"name": "activation_166", "inbound_nodes": [[["add_54", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_166", "trainable": false, "activation": "relu"}}, {"name": "res3d_branch2a", "inbound_nodes": [[["activation_166", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 128, "padding": "valid", "name": "res3d_branch2a", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn3d_branch2a", "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2a", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_167", "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_167", "trainable": false, "activation": "relu"}}, {"name": "res3d_branch2b", "inbound_nodes": [[["activation_167", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 128, "padding": "same", "name": "res3d_branch2b", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn3d_branch2b", "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2b", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_168", "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_168", "trainable": false, "activation": "relu"}}, {"name": "res3d_branch2c", "inbound_nodes": [[["activation_168", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 512, "padding": "valid", "name": "res3d_branch2c", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn3d_branch2c", "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2c", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "add_55", "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_166", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_55", "trainable": false}}, {"name": "activation_169", "inbound_nodes": [[["add_55", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_169", "trainable": false, "activation": "relu"}}, {"name": "res4a_branch2a", "inbound_nodes": [[["activation_169", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 256, "padding": "valid", "name": "res4a_branch2a", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn4a_branch2a", "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn4a_branch2a", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_170", "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_170", "trainable": false, "activation": "relu"}}, {"name": "res4a_branch2b", "inbound_nodes": [[["activation_170", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 256, "padding": "same", "name": "res4a_branch2b", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn4a_branch2b", "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn4a_branch2b", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_171", "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_171", "trainable": false, "activation": "relu"}}, {"name": "res4a_branch2c", "inbound_nodes": [[["activation_171", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 1024, "padding": "valid", "name": "res4a_branch2c", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "res4a_branch1", "inbound_nodes": [[["activation_169", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 1024, "padding": "valid", "name": "res4a_branch1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn4a_branch2c", "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn4a_branch2c", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "bn4a_branch1", "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn4a_branch1", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "add_56", "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_56", "trainable": false}}, {"name": "activation_172", "inbound_nodes": [[["add_56", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_172", "trainable": false, "activation": "relu"}}, {"name": "res4b_branch2a", "inbound_nodes": [[["activation_172", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 256, "padding": "valid", "name": "res4b_branch2a", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn4b_branch2a", "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn4b_branch2a", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_173", "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_173", "trainable": false, "activation": "relu"}}, {"name": "res4b_branch2b", "inbound_nodes": [[["activation_173", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 256, "padding": "same", "name": "res4b_branch2b", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn4b_branch2b", "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn4b_branch2b", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_174", "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_174", "trainable": false, "activation": "relu"}}, {"name": "res4b_branch2c", "inbound_nodes": [[["activation_174", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 1024, "padding": "valid", "name": "res4b_branch2c", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn4b_branch2c", "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn4b_branch2c", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "add_57", "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_172", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_57", "trainable": false}}, {"name": "activation_175", "inbound_nodes": [[["add_57", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_175", "trainable": false, "activation": "relu"}}, {"name": "res4c_branch2a", "inbound_nodes": [[["activation_175", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 256, "padding": "valid", "name": "res4c_branch2a", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn4c_branch2a", "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn4c_branch2a", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_176", "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_176", "trainable": false, "activation": "relu"}}, {"name": "res4c_branch2b", "inbound_nodes": [[["activation_176", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 256, "padding": "same", "name": "res4c_branch2b", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": false, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}}, {"name": "bn4c_branch2b", "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "bn4c_branch2b", "axis": 3, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_177", "inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_177", "trainable": 